11/data/attachments/b4339c88093f40e9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4a30ecd8-5f2c-444f-848c-1a470a06c87e</nif:username>
            <nif:friendToBeAdded>Kayla_determine_Friend_64996_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>